<a href="https://colab.research.google.com/github/manishaachary13/Alma_study/blob/main/sqlite.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import  sqlite3
connection=sqlite3.connect("aquarium.db")
print(connection.total_changes)

0

In [2]:
sqlite3.connect(':memory:')
# cursor object
# Syntax: cursor_object=connection_object.execute(“sql query”);

In [17]:
# create a hotel database
import sqlite3
connection=sqlite3.connect("hotel_data.db")

In [ ]:
# create table
connection.execute('''create table hotel
(FIND INT PRIMARY KEY     NOT NULL,
         FNAME           TEXT    NOT NULL,
         COST            INT     NOT NULL,
         WEIGHT        INT);
''')

In [19]:
# insert values into db
connection.execute(
    '''insert into hotel values
    (1, 'cakes',800,10 ),
    (2, 'biscuits',100,20 ),
    (3, 'chocos',1000,30 )'''
)

OperationalError: database is locked

In [15]:
print("All data in food table\n")
data=connection.execute("select * from hotel")
for row in data:
  print(row)

All data in food table

OperationalError: no such table: hotel

In [31]:
import sqlite3
connection=sqlite3.connect("alma.db")
cursor=connection.cursor()

In [32]:
# create table
# Creating table
table ="""CREATE TABLE STUDENT_DATA(NAME VARCHAR(255), CLASS VARCHAR(255),
SECTION VARCHAR(255));"""
cursor.execute(table)

In [33]:
# Queries to INSERT records.
cursor.execute('''INSERT INTO STUDENT_DATA (CLASS, SECTION, NAME)
  VALUES ('7th', 'A', 'Raju')
  ''')

cursor.execute(
  '''INSERT INTO STUDENT_DATA (SECTION, NAME, CLASS) VALUES ('B', 'Shyam', '8th')''')

cursor.execute(
  '''INSERT INTO STUDENT_DATA(NAME, CLASS, SECTION ) VALUES ('Baburao', '9th', 'C')''')

cursor.execute(
  '''INSERT INTO STUDENT_DATA(NAME, CLASS, SECTION ) VALUES ('Ajith', '9th', 'C')''')

cursor.execute(
  '''INSERT INTO STUDENT_DATA(NAME, CLASS, SECTION ) VALUES ('Karnan', '8th', 'B')''')

cursor.execute(
  '''INSERT INTO STUDENT_DATA (NAME, CLASS, SECTION ) VALUES ('Abhishek', '10th', 'A')''')
cursor.execute(
  '''INSERT INTO STUDENT_DATA (NAME, CLASS, SECTION ) VALUES ('Kishore', '9th', 'C')''')

print(connection.total_changes)

7

In [34]:
# Display data inserted
print("Data Inserted in the table: ")
# * is used to refer to all columns
data=cursor.execute('''SELECT * FROM STUDENT_DATA''')
for row in data:
    print(row)

print(connection.total_changes)

Data Inserted in the table:
('Raju', '7th', 'A')
('Shyam', '8th', 'B')
('Baburao', '9th', 'C')
('Ajith', '9th', 'C')
('Karnan', '8th', 'B')
('Abhishek', '10th', 'A')
('Kishore', '9th', 'C')
7

In [35]:
# Commit your changes in
# the database
connection.commit()

# Closing the connection
connection.close

In [36]:
connection=sqlite3.connect("alma.db")
cursor=connection.cursor()
cursor=cursor.execute('select * from student_data where class>"7th"')
print(cursor.fetchmany(2))
print(cursor.fetchone())
print(cursor.fetchall())
connection.commit()
connection.close()

[('Shyam', '8th', 'B'), ('Baburao', '9th', 'C')]
('Ajith', '9th', 'C')
[('Karnan', '8th', 'B'), ('Kishore', '9th', 'C')]

In [37]:
connection=sqlite3.connect("alma.db")
cursor=connection.cursor()
cursor=cursor.execute('delete from student_data where name="Kishore"')
cursor=cursor.execute('select * from student_data')
print(cursor.fetchall())
connection.commit()

[('Raju', '7th', 'A'), ('Shyam', '8th', 'B'), ('Baburao', '9th', 'C'), ('Ajith', '9th', 'C'), ('Karnan', '8th', 'B'), ('Abhishek', '10th', 'A')]

pandas have read_sql_query function to execute sql queries.


---

In [40]:
import pandas as pd
con=sqlite3.connect('alma.db')
df_students=pd.read_sql_query("select * from student_data",con)
print("All Students:\n",df_students)
df_new=df_students[:-1]
print("Remaining students:\n",df_new)

All Students:
        NAME CLASS SECTION
0      Raju   7th       A
1     Shyam   8th       B
2   Baburao   9th       C
3     Ajith   9th       C
4    Karnan   8th       B
5  Abhishek  10th       A
Remaining students:
       NAME CLASS SECTION
0     Raju   7th       A
1    Shyam   8th       B
2  Baburao   9th       C
3    Ajith   9th       C
4   Karnan   8th       B

In [41]:
df_new.to_sql("student11",con,if_exists="replace")
print(pd.read_sql_query("select * from student11",con))

   index     NAME CLASS SECTION
0      0     Raju   7th       A
1      1    Shyam   8th       B
2      2  Baburao   9th       C
3      3    Ajith   9th       C
4      4   Karnan   8th       B

In [ ]:
!pip install pandasql
# If there is an error i.e "ObjectNotExecutableError: Not an executable object:" then run the below command and restart kernel.
# pip install SQLAlchemy==1.4.46

In [1]:
from pandasql import sqldf
import pandas as pd

# Create a sample DataFrame.
df = pd.DataFrame({
    'Name': ['John', 'Jane', 'Bob', 'Mary'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'London', 'Paris', 'Sydney']
})

# Define a helper function that allows sqldf to access the DataFrame in the global scope.
def run_query(query):
    return sqldf(query, globals())

# Define your SQL query.
query = "SELECT * FROM df"

# Run the query using the helper function.
result = run_query(query)

# Print the result.
print(result)

   Name  Age      City
0  John   25  New York
1  Jane   30    London
2   Bob   35     Paris
3  Mary   40    Sydney

In [ ]:
# pip list | grep pandasql
# pip install pandasql --force-reinstall
!pip install pandasql --force-reinstall

In [2]:
query="select * from df where age>=30"
result = run_query(query)
print(result)

   Name  Age    City
0  Jane   30  London
1   Bob   35   Paris
2  Mary   40  Sydney

In [109]:
import pandas as pd
from pandasql import sqldf
import sqlite3
# a function to execute each query
my_sql=lambda q: sqldf(query,globals())

# connection to a db
con=sqlite3.connect("coffee_shop.db")
# create a cursor pointer object
c=con.cursor()

Create a new table named "transactions" in the database with the columns: "transaction_id", "date", "time", "item", "price", "quantity", and "total_amount".

In [110]:
c.execute('''CREATE TABLE transactions(
  transaction_id INTEGER PRIMARY KEY,
  date DATE,
  time TIME,
  item TEXT,
  price REAL,
  quantity INTEGER,
  total_amount REAL
);''')

In [111]:
# insert data into transactions
c.execute('''
    INSERT INTO transactions (
    transaction_id, date, time, item, price, quantity, total_amount)
    VALUES
    (1, '2022-01-01', '09:00', 'Coffee', 2.50, 1, 2.50),
    (2, '2022-01-01', '10:30', 'Croissant', 1.75, 2, 3.50),
    (3, '2022-01-01', '11:15', 'Cappuccino', 3.00, 1, 3.00),
    (4, '2022-01-02', '08:45', 'Latte', 3.50, 2, 7.00),
    (5, '2022-01-02', '10:00', 'Muffin', 2.25, 1, 2.25),
    (6, '2022-01-02', '12:15', 'Espresso', 2.75, 1, 2.75),
    (7, '2022-01-03', '09:30', 'Croissant', 1.75, 3, 5.25),
    (8, '2022-01-03', '11:00', 'Iced Coffee', 3.50, 2, 7.00),
    (9, '2022-01-03', '12:45', 'Hot Chocolate', 3.25, 1, 3.25),
    (10, '2022-01-04', '10:15', 'Cappuccino', 3.00, 2, 6.00);
''')

In [98]:
# Write a query to find the total number of transactions in the dataset.
pd.read_sql_query("SELECT COUNT(*) FROM transactions",con)

   COUNT(*)
0        10

In [107]:
pd.read_sql_query('''select count(*) as no_of_transactions from transactions
  where item="Croissant"'''
,con)

   no_of_transactions
0                   0

In [106]:
# Write a query to find the total amount of sales for each day in the dataset.
pd.read_sql_query("select date,sum(total_amount) as sales_per_day from transactions group by date",con)

Empty DataFrame
Columns: [date, sales_per_day]
Index: []

In [112]:
# Write a query to find the top 5 most popular items in the dataset, ranked by the total quantity sold.
def top_5():
  query= """
      SELECT item, SUM(quantity * price) as total_sales
      FROM transactions
      GROUP BY item
      order by total_sales desc
      """
  c.execute(query)
  result=c.fetchall()
  con.close()
  return result

print(top_5())

[('Cappuccino', 9.0), ('Croissant', 8.75), ('Latte', 7.0), ('Iced Coffee', 7.0), ('Hot Chocolate', 3.25), ('Espresso', 2.75), ('Coffee', 2.5), ('Muffin', 2.25)]

In [113]:
# Write a query to find the number of transactions that include a croissant.
def count_croissant():
  con=sqlite3.connect("coffee_shop.db")
  c=con.cursor()
  query='''select count(*) as no_of_transactions from transactions
  where item="Croissant"'''
  c.execute(query)
  result=c.fetchall()[0]
  return result
print(count_croissant())

(0,)

In [104]:
con=sqlite3.connect("coffee_shop.db")
c=con.cursor()
c.execute('''select count(*) as no_of_transactions from transactions
  where item="croissant"''')
c.fetchall()[0]

(0,)